dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbhs.c
/*
 * Copyright (c) 2026
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "usb_dc_ch32h417_usbhs.h"

#include <rtthread.h>
#include <string.h>

#include "ch32h417.h"
#include "board.h"

#define USBHS_INIT_TIMEOUT 1000000U
#define USBHS_EP_BUFFER_SIZE 1024U

/* USBHS register offsets (from USBHS base address) -- verified against USBHSD_TypeDef */
#define USBHS_OFFSET_USB_CTRL       0x00U
#define USBHS_OFFSET_USB_BASE_MODE  0x01U
#define USBHS_OFFSET_USB_INT_EN     0x02U
#define USBHS_OFFSET_USB_DEV_AD     0x03U
#define USBHS_OFFSET_USB_INT_FG     0x08U
#define USBHS_OFFSET_USB_INT_ST     0x09U
#define USBHS_OFFSET_USB_MIS_ST     0x0AU
#define USBHS_OFFSET_UEP_TX_EN      0x10U
#define USBHS_OFFSET_UEP_RX_EN      0x12U
#define USBHS_OFFSET_UEP0_DMA       0x20U
#define USBHS_OFFSET_UEP1_RX_DMA    0x24U
#define USBHS_OFFSET_UEP1_TX_DMA    0x40U
#define USBHS_OFFSET_UEP0_MAX_LEN   0x5CU
#define USBHS_OFFSET_UEP1_MAX_LEN   0x60U
#define USBHS_OFFSET_UEP0_RX_LEN    0x7CU
#define USBHS_OFFSET_UEP1_RX_LEN    0x80U
#define USBHS_OFFSET_UEP0_TX_LEN    0x9CU
#define USBHS_OFFSET_UEP1_TX_LEN    0xA0U
#define USBHS_OFFSET_UEP0_TX_CTRL   0x9EU
#define USBHS_OFFSET_UEP0_RX_CTRL   0x9FU
#define USBHS_OFFSET_UEP1_TX_CTRL   0xA2U
#define USBHS_OFFSET_UEP1_RX_CTRL   0xA3U

/* The following macros are already defined in ch32h417_usb.h (included via ch32h417.h):
 * USBHS_UD_RST_LINK, USBHS_UD_RST_SIE, USBHS_UD_CLR_ALL, USBHS_UD_PHY_SUSPENDM,
 * USBHS_UD_DMA_EN, USBHS_UD_DEV_EN, USBHS_UD_LPM_EN,
 * USBHS_UD_SPEED_HIGH, USBHS_UD_SPEED_FULL,
 * USBHS_UDIE_BUS_RST, USBHS_UDIE_SUSPEND, USBHS_UDIE_BUS_SLEEP, USBHS_UDIE_LPM_ACT,
 * USBHS_UDIE_TRANSFER, USBHS_UDIE_SOF_ACT, USBHS_UDIE_LINK_RDY, USBHS_UDIE_FIFO_OVER,
 * USBHS_UDIF_BUS_RST, USBHS_UDIF_SUSPEND, USBHS_UDIF_BUS_SLEEP, USBHS_UDIF_LPM_ACT,
 * USBHS_UDIF_TRANSFER, USBHS_UDIF_RX_SOF, USBHS_UDIF_LINK_RDY, USBHS_UDIF_FIFO_OV
 */

#define USBHS_UD_INT_EP_ID_MASK 0x07U
#define USBHS_UD_INT_DIR_IN     (1U << 4)
#define USBHS_UD_INT_DIR_OUT    (0U)

/* Compatibility aliases for endpoint control macros (SDK uses T/R suffixes) */
#define USBHS_UEP_TX_RES_NAK    USBHS_UEP_T_RES_NAK
#define USBHS_UEP_TX_RES_STALL  USBHS_UEP_T_RES_STALL
#define USBHS_UEP_TX_RES_ACK    USBHS_UEP_T_RES_ACK
#define USBHS_UEP_TX_D0         USBHS_UEP_T_TOG_DATA0
#define USBHS_UEP_TX_D1         USBHS_UEP_T_TOG_DATA1
#define USBHS_UEP_TX_DONE       USBHS_UEP_T_DONE

#define USBHS_UEP_RX_RES_NAK    USBHS_UEP_R_RES_NAK
#define USBHS_UEP_RX_RES_STALL  USBHS_UEP_R_RES_STALL
#define USBHS_UEP_RX_RES_ACK    USBHS_UEP_R_RES_ACK
#define USBHS_UEP_RX_D0         USBHS_UEP_R_TOG_DATA0
#define USBHS_UEP_RX_D1         USBHS_UEP_R_TOG_DATA1
#define USBHS_UEP_RX_TOG_MATCH  USBHS_UEP_R_TOG_MATCH
#define USBHS_UEP_RX_SETUP_IS   USBHS_UEP_R_SETUP_IS
#define USBHS_UEP_RX_DONE       USBHS_UEP_R_DONE

struct usb_dc_ep_state {
    uint16_t ep_mps;
    uint8_t ep_type;
    uint8_t ep_stalled;
    uint8_t ep_enabled;
    uint8_t ep_toggle;
    uint8_t *xfer_buf;
    uint32_t xfer_len;
    uint32_t actual_xfer_len;
};

struct ch32h417_usbhs_udc {
    volatile uint8_t dev_addr;
    uint8_t addr_pending;
    uint8_t port_speed;
    struct usb_dc_ep_state in_ep[USB_CH32H417_MAX_EP_NUM];
    struct usb_dc_ep_state out_ep[USB_CH32H417_MAX_EP_NUM];
};

struct ch32h417_usbhs_diag {
    volatile uint32_t irq;
    volatile uint32_t reset;
    volatile uint32_t suspend;
    volatile uint32_t sleep;
    volatile uint32_t lpm;
    volatile uint32_t link_ready;
    volatile uint32_t transfer;
    volatile uint32_t setup;
    volatile uint32_t ep0_in;
    volatile uint32_t ep0_out;
    volatile uint32_t ep_in;
    volatile uint32_t ep_out;
    volatile uint32_t set_addr;
    volatile uint32_t stall;
    volatile uint32_t last_int_fg;
    volatile uint32_t last_int_st;
    volatile uint32_t last_rx_len;
    volatile uint32_t rcc_ctlr;
    volatile uint32_t rcc_pllcfgr;
    volatile uint32_t rcc_pllcfgr2;
    volatile uint32_t rcc_hbpcenr;
};

static struct ch32h417_usbhs_udc g_ch32h417_usbhs_udc;
static struct ch32h417_usbhs_diag g_ch32h417_usbhs_diag;
static uint8_t g_ch32h417_usbhs_initialized;

static __attribute__((aligned(4))) uint8_t ep0_buffer[USB_CH32H417_EP0_MPS];
static __attribute__((aligned(4))) uint8_t ep_tx_buffer[USB_CH32H417_MAX_EP_NUM][USBHS_EP_BUFFER_SIZE];
static __attribute__((aligned(4))) uint8_t ep_rx_buffer[USB_CH32H417_MAX_EP_NUM][USBHS_EP_BUFFER_SIZE];

static inline __IO uint8_t *usbhs_reg8(uint32_t offset)
{
    return (__IO uint8_t *)((uintptr_t)USBHS_BASE + offset);
}

static inline __IO uint16_t *usbhs_reg16(uint32_t offset)
{
    return (__IO uint16_t *)((uintptr_t)USBHS_BASE + offset);
}

static inline __IO uint32_t *usbhs_reg32(uint32_t offset)
{
    return (__IO uint32_t *)((uintptr_t)USBHS_BASE + offset);
}

static inline uint32_t usbhs_ep_rx_dma_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_DMA : (USBHS_OFFSET_UEP1_RX_DMA + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline uint32_t usbhs_ep_tx_dma_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_DMA : (USBHS_OFFSET_UEP1_TX_DMA + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline uint32_t usbhs_ep_max_len_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_MAX_LEN : (USBHS_OFFSET_UEP1_MAX_LEN + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline uint32_t usbhs_ep_rx_len_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_RX_LEN : (USBHS_OFFSET_UEP1_RX_LEN + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline uint32_t usbhs_ep_tx_len_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_TX_LEN : (USBHS_OFFSET_UEP1_TX_LEN + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline uint32_t usbhs_ep_rx_ctrl_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_RX_CTRL : (USBHS_OFFSET_UEP1_RX_CTRL + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline uint32_t usbhs_ep_tx_ctrl_offset(uint8_t ep_idx)
{
    return (ep_idx == 0U) ? USBHS_OFFSET_UEP0_TX_CTRL : (USBHS_OFFSET_UEP1_TX_CTRL + ((uint32_t)(ep_idx - 1U) * 4U));
}

static inline __IO uint16_t *usbhs_ep_max_len_reg(uint8_t ep_idx)
{
    return usbhs_reg16(usbhs_ep_max_len_offset(ep_idx));
}

