dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbhs.c
static inline __IO uint32_t *usbhs_ep_rx_dma_reg(uint8_t ep_idx)
{
    return usbhs_reg32(usbhs_ep_rx_dma_offset(ep_idx));
}

static inline __IO uint32_t *usbhs_ep_tx_dma_reg(uint8_t ep_idx)
{
    return usbhs_reg32(usbhs_ep_tx_dma_offset(ep_idx));
}

static inline __IO uint16_t *usbhs_ep_rx_len_reg(uint8_t ep_idx)
{
    return usbhs_reg16(usbhs_ep_rx_len_offset(ep_idx));
}

static inline __IO uint16_t *usbhs_ep_tx_len_reg(uint8_t ep_idx)
{
    return usbhs_reg16(usbhs_ep_tx_len_offset(ep_idx));
}

static inline __IO uint8_t *usbhs_ep_rx_ctrl_reg(uint8_t ep_idx)
{
    return usbhs_reg8(usbhs_ep_rx_ctrl_offset(ep_idx));
}

static inline __IO uint8_t *usbhs_ep_tx_ctrl_reg(uint8_t ep_idx)
{
    return usbhs_reg8(usbhs_ep_tx_ctrl_offset(ep_idx));
}

__WEAK void usb_dc_low_level_init(void)
{
    (void)0;
}

__WEAK void usb_dc_low_level_deinit(void)
{
    (void)0;
}

static int usbhs_rcc_init(void)
{
    uint32_t timeout;

    if ((RCC->PLLCFGR & RCC_SYSPLL_SEL) != RCC_SYSPLL_USBHS) {
        RCC_USBHS_PLLCmd(DISABLE);
        RCC_USBHSPLLCLKConfig(RCC_USBHSPLLSource_HSE);
        RCC_USBHSPLLReferConfig(RCC_USBHSPLLRefer_25M);
        RCC_USBHSPLLClockSourceDivConfig(RCC_USBHSPLL_IN_Div1);
        RCC_USBHS_PLLCmd(ENABLE);
    } else if ((RCC->CTLR & RCC_USBHS_PLLRDY) == 0U) {
        RCC_USBHS_PLLCmd(ENABLE);
    }

    for (timeout = 0U; timeout < USBHS_INIT_TIMEOUT; timeout++) {
        if ((RCC->CTLR & RCC_USBHS_PLLRDY) != 0U) {
            break;
        }
        __NOP();
    }
    if (timeout >= USBHS_INIT_TIMEOUT) {
        rt_kprintf("[USBHS] PLL ready timeout ctl=0x%08x pll=0x%08x pll2=0x%08x\r\n",
                   (unsigned int)RCC->CTLR,
                   (unsigned int)RCC->PLLCFGR,
                   (unsigned int)RCC->PLLCFGR2);
        return -1;
    }

    RCC_UTMIcmd(ENABLE);
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBHS, ENABLE);
    return 0;
}

static void usbhs_rcc_deinit(void)
{
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBHS, DISABLE);
}

static void usbhs_ep0_state_init(void)
{
    g_ch32h417_usbhs_udc.out_ep[0].ep_mps = USB_CH32H417_EP0_MPS;
    g_ch32h417_usbhs_udc.out_ep[0].ep_type = USB_ENDPOINT_TYPE_CONTROL;
    g_ch32h417_usbhs_udc.out_ep[0].ep_enabled = 1U;
    g_ch32h417_usbhs_udc.out_ep[0].ep_toggle = 0U;
    g_ch32h417_usbhs_udc.out_ep[0].xfer_buf = NULL;
    g_ch32h417_usbhs_udc.out_ep[0].xfer_len = 0U;
    g_ch32h417_usbhs_udc.out_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbhs_udc.out_ep[0].ep_stalled = 0U;

    g_ch32h417_usbhs_udc.in_ep[0].ep_mps = USB_CH32H417_EP0_MPS;
    g_ch32h417_usbhs_udc.in_ep[0].ep_type = USB_ENDPOINT_TYPE_CONTROL;
    g_ch32h417_usbhs_udc.in_ep[0].ep_enabled = 1U;
    g_ch32h417_usbhs_udc.in_ep[0].ep_toggle = 0U;
    g_ch32h417_usbhs_udc.in_ep[0].xfer_buf = NULL;
    g_ch32h417_usbhs_udc.in_ep[0].xfer_len = 0U;
    g_ch32h417_usbhs_udc.in_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbhs_udc.in_ep[0].ep_stalled = 0U;

    *usbhs_reg16(USBHS_OFFSET_UEP_TX_EN) |= 1U;
    *usbhs_reg16(USBHS_OFFSET_UEP_RX_EN) |= 1U;
    *usbhs_ep_max_len_reg(0U) = USB_CH32H417_EP0_MPS;
    *usbhs_ep_rx_dma_reg(0U) = (uint32_t)ep0_buffer;
    *usbhs_ep_tx_dma_reg(0U) = (uint32_t)ep0_buffer;
    *usbhs_ep_rx_len_reg(0U) = 0U;
    *usbhs_ep_tx_len_reg(0U) = 0U;
    *usbhs_ep_rx_ctrl_reg(0U) = USBHS_UEP_RX_RES_ACK;
    *usbhs_ep_tx_ctrl_reg(0U) = USBHS_UEP_TX_RES_NAK;
}

static void usbhs_clear_all_transfer_state(void)
{
    uint8_t ep_idx;

    memset(&g_ch32h417_usbhs_udc, 0, sizeof(g_ch32h417_usbhs_udc));
    for (ep_idx = 0U; ep_idx < USB_CH32H417_MAX_EP_NUM; ep_idx++) {
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_mps = 0U;
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_mps = 0U;
    }
    usbhs_ep0_state_init();
}

static void usbhs_apply_pending_address(void)
{
    if (g_ch32h417_usbhs_udc.addr_pending != 0U) {
        *usbhs_reg8(USBHS_OFFSET_USB_DEV_AD) = g_ch32h417_usbhs_udc.dev_addr;
        g_ch32h417_usbhs_udc.addr_pending = 0U;
    }
}

static void usbhs_ep_prime_in(uint8_t ep_idx, const uint8_t *data, uint32_t data_len)
{
    uint8_t toggle = (g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_toggle == 0U) ? USBHS_UEP_TX_D0 : USBHS_UEP_TX_D1;
    uint8_t ctrl = (uint8_t)(toggle | USBHS_UEP_TX_RES_ACK);
    uint16_t xfer_len = (data_len > 0xFFFFU) ? 0xFFFFU : (uint16_t)data_len;

    if (ep_idx == 0U) {
        if (data && (data_len != 0U)) {
            memcpy(ep0_buffer, data, data_len);
        }
        *usbhs_ep_tx_dma_reg(0U) = (uint32_t)ep0_buffer;
        *usbhs_ep_tx_len_reg(0U) = xfer_len;
        *usbhs_ep_tx_ctrl_reg(0U) = ctrl;
    } else {
        if (data && (data_len != 0U)) {
            memcpy(ep_tx_buffer[ep_idx], data, data_len);
        }
        *usbhs_ep_tx_dma_reg(ep_idx) = (uint32_t)ep_tx_buffer[ep_idx];
        *usbhs_ep_tx_len_reg(ep_idx) = xfer_len;
        *usbhs_ep_tx_ctrl_reg(ep_idx) = ctrl;
    }
    g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_toggle ^= 1U;
}

static void usbhs_ep_prime_out(uint8_t ep_idx)
{
    uint8_t toggle = (g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_toggle == 0U) ? USBHS_UEP_RX_D0 : USBHS_UEP_RX_D1;
    uint8_t ctrl = (uint8_t)(toggle | USBHS_UEP_RX_RES_ACK | USBHS_UEP_RX_TOG_MATCH);

    if (ep_idx == 0U) {
        *usbhs_ep_rx_dma_reg(0U) = (uint32_t)ep0_buffer;
        *usbhs_ep_rx_len_reg(0U) = 0U;
        *usbhs_ep_rx_ctrl_reg(0U) = (uint8_t)(toggle | USBHS_UEP_RX_RES_ACK);
    } else {
        *usbhs_ep_rx_dma_reg(ep_idx) = (uint32_t)ep_rx_buffer[ep_idx];
        *usbhs_ep_rx_len_reg(ep_idx) = 0U;
        *usbhs_ep_rx_ctrl_reg(ep_idx) = ctrl;
    }
}

static void usbhs_handle_setup_packet(uint8_t busid)
{
    g_ch32h417_usbhs_udc.out_ep[0].ep_toggle = 1U;
    g_ch32h417_usbhs_udc.out_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbhs_udc.out_ep[0].xfer_len = 0U;
    g_ch32h417_usbhs_udc.out_ep[0].xfer_buf = NULL;
    g_ch32h417_usbhs_udc.in_ep[0].ep_toggle = 1U;
    g_ch32h417_usbhs_udc.in_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbhs_udc.in_ep[0].xfer_len = 0U;
    g_ch32h417_usbhs_udc.in_ep[0].xfer_buf = NULL;
    *usbhs_ep_tx_ctrl_reg(0U) = USBHS_UEP_TX_D1 | USBHS_UEP_TX_RES_NAK;
    *usbhs_ep_rx_ctrl_reg(0U) = USBHS_UEP_RX_D1 | USBHS_UEP_RX_RES_NAK;
    g_ch32h417_usbhs_diag.setup++;
    usbd_event_ep0_setup_complete_handler(busid, ep0_buffer);
}

