dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbhs.c
static void usbhs_handle_ep0_in_xfer_complete(uint8_t busid)
{
    struct usb_dc_ep_state *ep0 = &g_ch32h417_usbhs_udc.in_ep[0];
    uint16_t tx_len = *usbhs_ep_tx_len_reg(0U);
    uint8_t tx_ctrl = *usbhs_ep_tx_ctrl_reg(0U);

    *usbhs_ep_tx_ctrl_reg(0U) = (uint8_t)(tx_ctrl & (uint8_t)~USBHS_UEP_TX_DONE);

    if (tx_len > ep0->xfer_len) {
        tx_len = (uint16_t)ep0->xfer_len;
    }
    ep0->actual_xfer_len += tx_len;
    if (ep0->xfer_len >= (uint32_t)tx_len) {
        ep0->xfer_len -= (uint32_t)tx_len;
    } else {
        ep0->xfer_len = 0U;
    }

    if (ep0->xfer_len == 0U) {
        usbhs_apply_pending_address();
        g_ch32h417_usbhs_diag.ep0_in++;
        usbd_event_ep_in_complete_handler(busid, USB_CONTROL_IN_EP0, ep0->actual_xfer_len);
    } else {
        uint32_t next_len = (ep0->xfer_len > ep0->ep_mps) ? ep0->ep_mps : ep0->xfer_len;
        if (ep0->xfer_buf != NULL) {
            usbhs_ep_prime_in(0U, ep0->xfer_buf + ep0->actual_xfer_len, next_len);
        } else {
            usbhs_ep_prime_in(0U, NULL, 0U);
        }
    }
}

static void usbhs_handle_ep_in_xfer_complete(uint8_t busid, uint8_t ep_idx)
{
    struct usb_dc_ep_state *ep = &g_ch32h417_usbhs_udc.in_ep[ep_idx];
    uint16_t tx_len = *usbhs_ep_tx_len_reg(ep_idx);
    uint8_t tx_ctrl = *usbhs_ep_tx_ctrl_reg(ep_idx);
    uint8_t last = 0U;

    *usbhs_ep_tx_ctrl_reg(ep_idx) = (uint8_t)(tx_ctrl & (uint8_t)~USBHS_UEP_TX_DONE);

    if (tx_len > ep->xfer_len) {
        tx_len = (uint16_t)ep->xfer_len;
    }
    ep->actual_xfer_len += tx_len;
    if (ep->xfer_len >= (uint32_t)tx_len) {
        ep->xfer_len -= (uint32_t)tx_len;
    } else {
        ep->xfer_len = 0U;
    }

    if (ep->xfer_len == 0U) {
        last = 1U;
    } else if (ep->xfer_buf != NULL) {
        uint32_t next_len = (ep->xfer_len > ep->ep_mps) ? ep->ep_mps : ep->xfer_len;
        usbhs_ep_prime_in(ep_idx, ep->xfer_buf + ep->actual_xfer_len, next_len);
    } else {
        usbhs_ep_prime_in(ep_idx, NULL, 0U);
    }

    if (last != 0U) {
        g_ch32h417_usbhs_diag.ep_in++;
        usbd_event_ep_in_complete_handler(busid, (uint8_t)(ep_idx | 0x80U), ep->actual_xfer_len);
    }
}

static void usbhs_handle_ep0_out_xfer_complete(uint8_t busid)
{
    struct usb_dc_ep_state *ep0 = &g_ch32h417_usbhs_udc.out_ep[0];
    uint16_t rx_len = *usbhs_ep_rx_len_reg(0U);
    uint8_t done = 0U;
    uint8_t rx_ctrl = *usbhs_ep_rx_ctrl_reg(0U);

    *usbhs_ep_rx_ctrl_reg(0U) = (uint8_t)(rx_ctrl & (uint8_t)~USBHS_UEP_RX_DONE);
    if ((rx_ctrl & USBHS_UEP_RX_SETUP_IS) != 0U) {
        usbhs_handle_setup_packet(busid);
        return;
    }

    if ((ep0->xfer_buf != NULL) && (rx_len != 0U)) {
        if (rx_len > USBHS_EP_BUFFER_SIZE) {
            rx_len = USBHS_EP_BUFFER_SIZE;
        }
        memcpy(ep0->xfer_buf + ep0->actual_xfer_len, ep0_buffer, rx_len);
    }

    ep0->actual_xfer_len += rx_len;
    if (ep0->xfer_len >= (uint32_t)rx_len) {
        ep0->xfer_len -= (uint32_t)rx_len;
    } else {
        ep0->xfer_len = 0U;
    }

    if ((ep0->xfer_len == 0U) || (rx_len < ep0->ep_mps)) {
        done = 1U;
    }

    ep0->ep_toggle ^= 1U;
    if (done != 0U) {
        g_ch32h417_usbhs_diag.ep0_out++;
        usbd_event_ep_out_complete_handler(busid, USB_CONTROL_OUT_EP0, ep0->actual_xfer_len);
    } else {
        usbhs_ep_prime_out(0U);
    }
}

static void usbhs_handle_ep_out_xfer_complete(uint8_t busid, uint8_t ep_idx)
{
    struct usb_dc_ep_state *ep = &g_ch32h417_usbhs_udc.out_ep[ep_idx];
    uint16_t rx_len = *usbhs_ep_rx_len_reg(ep_idx);
    uint8_t rx_ctrl = *usbhs_ep_rx_ctrl_reg(ep_idx);

    *usbhs_ep_rx_ctrl_reg(ep_idx) = (uint8_t)(rx_ctrl & (uint8_t)~USBHS_UEP_RX_DONE);

    if (ep->xfer_buf != NULL && (rx_len != 0U)) {
        if ((ep->actual_xfer_len + (uint32_t)rx_len) > USBHS_EP_BUFFER_SIZE) {
            rx_len = (uint16_t)(USBHS_EP_BUFFER_SIZE - ep->actual_xfer_len);
        }
        if (rx_len != 0U) {
            memcpy(ep->xfer_buf + ep->actual_xfer_len, ep_rx_buffer[ep_idx], rx_len);
        }
    }

    ep->actual_xfer_len += rx_len;
    if (ep->xfer_len >= (uint32_t)rx_len) {
        ep->xfer_len -= (uint32_t)rx_len;
    } else {
        ep->xfer_len = 0U;
    }

    if ((ep->xfer_len == 0U) || (rx_len < ep->ep_mps)) {
        ep->xfer_len = 0U;
        ep->ep_toggle ^= 1U;
        g_ch32h417_usbhs_diag.ep_out++;
        usbd_event_ep_out_complete_handler(busid, ep_idx, ep->actual_xfer_len);
    } else {
        ep->ep_toggle ^= 1U;
        usbhs_ep_prime_out(ep_idx);
    }
}

int usb_dc_ch32h417_usbhs_init(uint8_t busid)
{
    if (busid != USB_CH32H417_BUS_HS) {
        return -1;
    }

    usb_dc_low_level_init();
    if (usbhs_rcc_init() != 0) {
        return -1;
    }

    memset(&g_ch32h417_usbhs_udc, 0, sizeof(g_ch32h417_usbhs_udc));
    memset(&g_ch32h417_usbhs_diag, 0, sizeof(g_ch32h417_usbhs_diag));
    g_ch32h417_usbhs_udc.port_speed = USB_SPEED_HIGH;

    USBHSD->CONTROL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;
    USBHSD->INT_FG = 0xFFU;
    USBHSD->INT_EN = USBHS_UDIE_BUS_RST | USBHS_UDIE_SUSPEND | USBHS_UDIE_BUS_SLEEP |
                     USBHS_UDIE_LPM_ACT | USBHS_UDIE_TRANSFER | USBHS_UDIE_LINK_RDY;
    USBHSD->BASE_MODE = USBHS_UD_SPEED_HIGH;
    usbhs_clear_all_transfer_state();
    USBHSD->DEV_AD = 0U;
    USBHSD->CONTROL = USBHS_UD_DEV_EN | USBHS_UD_DMA_EN | USBHS_UD_LPM_EN | USBHS_UD_PHY_SUSPENDM;

    g_ch32h417_usbhs_initialized = 1U;
    g_ch32h417_usbhs_diag.rcc_ctlr = RCC->CTLR;
    g_ch32h417_usbhs_diag.rcc_pllcfgr = RCC->PLLCFGR;
    g_ch32h417_usbhs_diag.rcc_pllcfgr2 = RCC->PLLCFGR2;
    g_ch32h417_usbhs_diag.rcc_hbpcenr = RCC->HBPCENR;

    NVIC_SetPriority(USBHS_IRQn, 1);
    NVIC_EnableIRQ(USBHS_IRQn);
    rt_kprintf("[USBHS] device init done ctl=0x%02x mode=0x%02x ie=0x%02x fg=0x%02x pcfr1=0x%08x rcc=0x%08x/0x%08x/0x%08x hb=0x%08x\r\n",
               (unsigned int)USBHSD->CONTROL,
               (unsigned int)USBHSD->BASE_MODE,
               (unsigned int)USBHSD->INT_EN,
               (unsigned int)USBHSD->INT_FG,
               (unsigned int)AFIO->PCFR1,
               (unsigned int)RCC->CTLR,
               (unsigned int)RCC->PLLCFGR,
               (unsigned int)RCC->PLLCFGR2,
               (unsigned int)RCC->HBPCENR);
    return 0;
}

int usb_dc_ch32h417_usbhs_deinit(uint8_t busid)
{
    (void)busid;

    NVIC_DisableIRQ(USBHS_IRQn);
    USBHSD->CONTROL = USBHS_UD_RST_SIE | USBHS_UD_RST_LINK;
    USBHSD->INT_EN = 0U;
    USBHSD->INT_FG = 0xFFU;
    g_ch32h417_usbhs_initialized = 0U;
    usbhs_rcc_deinit();
    usb_dc_low_level_deinit();
    return 0;
}

int usb_dc_ch32h417_usbhs_set_address(uint8_t busid, const uint8_t addr)
{
    (void)busid;
    g_ch32h417_usbhs_udc.dev_addr = addr;
    g_ch32h417_usbhs_udc.addr_pending = 1U;
    g_ch32h417_usbhs_diag.set_addr++;
    return 0;
}

int usb_dc_ch32h417_usbhs_set_remote_wakeup(uint8_t busid)
{
    (void)busid;
    return -1;
}

