dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbhs.c
uint8_t usb_dc_ch32h417_usbhs_get_port_speed(uint8_t busid)
{
    (void)busid;
    return USB_SPEED_HIGH;
}

int usb_dc_ch32h417_usbhs_ep_open(uint8_t busid, const struct usb_endpoint_descriptor *ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep->bEndpointAddress);
    uint16_t ep_mps = USB_GET_MAXPACKETSIZE(ep->wMaxPacketSize);
    uint8_t ep_type = USB_GET_ENDPOINT_TYPE(ep->bmAttributes);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        usbhs_ep0_state_init();
        return 0;
    }

    if (USB_EP_DIR_IS_OUT(ep->bEndpointAddress)) {
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_mps = ep_mps;
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_type = ep_type;
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_enabled = 1U;
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_toggle = 0U;
        *usbhs_ep_max_len_reg(ep_idx) = ep_mps;
        *usbhs_reg16(USBHS_OFFSET_UEP_RX_EN) |= (uint16_t)(1U << ep_idx);
        *usbhs_ep_rx_dma_reg(ep_idx) = (uint32_t)ep_rx_buffer[ep_idx];
        *usbhs_ep_rx_len_reg(ep_idx) = 0U;
        *usbhs_ep_rx_ctrl_reg(ep_idx) = USBHS_UEP_RX_RES_ACK | USBHS_UEP_RX_D0 | USBHS_UEP_RX_TOG_MATCH;
    } else {
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_mps = ep_mps;
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_type = ep_type;
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_enabled = 1U;
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_toggle = 0U;
        *usbhs_ep_max_len_reg(ep_idx) = ep_mps;
        *usbhs_reg16(USBHS_OFFSET_UEP_TX_EN) |= (uint16_t)(1U << ep_idx);
        *usbhs_ep_tx_dma_reg(ep_idx) = (uint32_t)ep_tx_buffer[ep_idx];
        *usbhs_ep_tx_len_reg(ep_idx) = 0U;
        *usbhs_ep_tx_ctrl_reg(ep_idx) = USBHS_UEP_TX_RES_NAK | USBHS_UEP_TX_D0;
    }

    return 0;
}

int usb_dc_ch32h417_usbhs_ep_close(uint8_t busid, const uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        g_ch32h417_usbhs_udc.in_ep[0].ep_enabled = 0U;
        g_ch32h417_usbhs_udc.out_ep[0].ep_enabled = 0U;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_enabled = 0U;
        *usbhs_reg16(USBHS_OFFSET_UEP_RX_EN) &= (uint16_t)~(1U << ep_idx);
    } else {
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_enabled = 0U;
        *usbhs_reg16(USBHS_OFFSET_UEP_TX_EN) &= (uint16_t)~(1U << ep_idx);
    }

    return 0;
}

int usb_dc_ch32h417_usbhs_set_stall(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        *usbhs_ep_tx_ctrl_reg(0U) = USBHS_UEP_TX_RES_STALL | USBHS_UEP_TX_D1;
        *usbhs_ep_rx_ctrl_reg(0U) = USBHS_UEP_RX_RES_STALL | USBHS_UEP_RX_D1;
        g_ch32h417_usbhs_udc.in_ep[0].ep_stalled = 1U;
        g_ch32h417_usbhs_udc.out_ep[0].ep_stalled = 1U;
        g_ch32h417_usbhs_diag.stall++;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        *usbhs_ep_rx_ctrl_reg(ep_idx) = USBHS_UEP_RX_RES_STALL | USBHS_UEP_RX_D0;
        g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_stalled = 1U;
    } else {
        *usbhs_ep_tx_ctrl_reg(ep_idx) = USBHS_UEP_TX_RES_STALL | USBHS_UEP_TX_D0;
        g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_stalled = 1U;
    }

    return 0;
}

int usb_dc_ch32h417_usbhs_clear_stall(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint8_t in_pid;
    uint8_t out_pid;

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    in_pid = (g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_toggle == 0U) ? USBHS_UEP_TX_D0 : USBHS_UEP_TX_D1;
    out_pid = (g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_toggle == 0U) ? USBHS_UEP_RX_D0 : USBHS_UEP_RX_D1;
    g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_stalled = 0U;
    g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_stalled = 0U;
    g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_toggle = 0U;
    g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_toggle = 0U;

    if (ep_idx == 0U) {
        *usbhs_ep_tx_ctrl_reg(0U) = USBHS_UEP_TX_RES_NAK;
        *usbhs_ep_rx_ctrl_reg(0U) = USBHS_UEP_RX_RES_ACK;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        *usbhs_ep_rx_ctrl_reg(ep_idx) = (uint8_t)(out_pid | USBHS_UEP_RX_RES_ACK | USBHS_UEP_RX_TOG_MATCH);
    } else {
        *usbhs_ep_tx_ctrl_reg(ep_idx) = (uint8_t)(in_pid | USBHS_UEP_TX_RES_ACK);
    }

    return 0;
}

int usb_dc_ch32h417_usbhs_is_stalled(uint8_t busid, const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if ((ep_idx >= USB_CH32H417_MAX_EP_NUM) || (stalled == NULL)) {
        return -1;
    }

    if (USB_EP_DIR_IS_OUT(ep)) {
        *stalled = g_ch32h417_usbhs_udc.out_ep[ep_idx].ep_stalled;
    } else {
        *stalled = g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_stalled;
    }
    return 0;
}

int usb_dc_ch32h417_usbhs_start_write(uint8_t busid, uint8_t ep, const uint8_t *data, uint32_t data_len)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t ep_mps;
    uint32_t send_len;

    (void)busid;

    if (!data && (data_len != 0U)) {
        return -1;
    }

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    ep_mps = (uint32_t)g_ch32h417_usbhs_udc.in_ep[ep_idx].ep_mps;
    if ((ep_idx != 0U) && (ep_mps == 0U)) {
        ep_mps = USB_CH32H417_EP0_MPS;
    }
    g_ch32h417_usbhs_udc.in_ep[ep_idx].xfer_buf = (uint8_t *)data;
    g_ch32h417_usbhs_udc.in_ep[ep_idx].xfer_len = data_len;
    g_ch32h417_usbhs_udc.in_ep[ep_idx].actual_xfer_len = 0U;

    send_len = (data_len > ep_mps) ? ep_mps : data_len;
    usbhs_ep_prime_in(ep_idx, data, send_len);

    return 0;
}

int usb_dc_ch32h417_usbhs_start_read(uint8_t busid, uint8_t ep, uint8_t *data, uint32_t data_len)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (!data && (data_len != 0U)) {
        return -1;
    }

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    g_ch32h417_usbhs_udc.out_ep[ep_idx].xfer_buf = data;
    g_ch32h417_usbhs_udc.out_ep[ep_idx].xfer_len = data_len;
    g_ch32h417_usbhs_udc.out_ep[ep_idx].actual_xfer_len = 0U;
    usbhs_ep_prime_out(ep_idx);

