dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbhs.c
    return 0;
}

void usb_dc_ch32h417_usbhs_dump_diag(void)
{
    if (g_ch32h417_usbhs_initialized == 0U) {
        return;
    }

    rt_kprintf("[USBHS diag] irq=%u rst=%u sus=%u slp=%u lpm=%u rdy=%u xfer=%u setup=%u in0=%u out0=%u in=%u out=%u stall=%u addr=%u\r\n",
               (unsigned int)g_ch32h417_usbhs_diag.irq,
               (unsigned int)g_ch32h417_usbhs_diag.reset,
               (unsigned int)g_ch32h417_usbhs_diag.suspend,
               (unsigned int)g_ch32h417_usbhs_diag.sleep,
               (unsigned int)g_ch32h417_usbhs_diag.lpm,
               (unsigned int)g_ch32h417_usbhs_diag.link_ready,
               (unsigned int)g_ch32h417_usbhs_diag.transfer,
               (unsigned int)g_ch32h417_usbhs_diag.setup,
               (unsigned int)g_ch32h417_usbhs_diag.ep0_in,
               (unsigned int)g_ch32h417_usbhs_diag.ep0_out,
               (unsigned int)g_ch32h417_usbhs_diag.ep_in,
               (unsigned int)g_ch32h417_usbhs_diag.ep_out,
               (unsigned int)g_ch32h417_usbhs_diag.stall,
               (unsigned int)g_ch32h417_usbhs_diag.set_addr);
    rt_kprintf("[USBHS regs] ctl=0x%02x mode=0x%02x ie=0x%02x fg=0x%02x st=0x%02x da=0x%02x rxlen=%u e0t=0x%02x e0r=0x%02x rcc=0x%08x/0x%08x/0x%08x hb=0x%08x\r\n",
               (unsigned int)USBHSD->CONTROL,
               (unsigned int)USBHSD->BASE_MODE,
               (unsigned int)USBHSD->INT_EN,
               (unsigned int)USBHSD->INT_FG,
               (unsigned int)USBHSD->INT_ST,
               (unsigned int)USBHSD->DEV_AD,
               (unsigned int)(*usbhs_ep_rx_len_reg(0U)),
               (unsigned int)(*usbhs_ep_tx_ctrl_reg(0U)),
               (unsigned int)(*usbhs_ep_rx_ctrl_reg(0U)),
               (unsigned int)RCC->CTLR,
               (unsigned int)RCC->PLLCFGR,
               (unsigned int)RCC->PLLCFGR2,
               (unsigned int)RCC->HBPCENR);
}

void USBD_IRQHandler(uint8_t busid)
{
    uint8_t int_fg;
    uint8_t int_st;
    uint8_t ep_idx;

    int_fg = *usbhs_reg8(USBHS_OFFSET_USB_INT_FG);
    if (int_fg == 0U) {
        return;
    }
    int_st = *usbhs_reg8(USBHS_OFFSET_USB_INT_ST);
    g_ch32h417_usbhs_diag.irq++;
    g_ch32h417_usbhs_diag.last_int_fg = int_fg;
    g_ch32h417_usbhs_diag.last_int_st = int_st;
    g_ch32h417_usbhs_diag.last_rx_len = (uint32_t)(*usbhs_ep_rx_len_reg(0U));

    if ((int_fg & USBHS_UDIF_BUS_RST) != 0U) {
        g_ch32h417_usbhs_diag.reset++;
        usbhs_clear_all_transfer_state();
        g_ch32h417_usbhs_udc.port_speed = USB_SPEED_HIGH;
        g_ch32h417_usbhs_udc.dev_addr = 0U;
        g_ch32h417_usbhs_udc.addr_pending = 0U;
        *usbhs_reg8(USBHS_OFFSET_USB_DEV_AD) = 0U;
        usbd_event_reset_handler(busid);
    }

    if ((int_fg & USBHS_UDIF_SUSPEND) != 0U) {
        g_ch32h417_usbhs_diag.suspend++;
        usbd_event_suspend_handler(busid);
    }
    if ((int_fg & USBHS_UDIF_BUS_SLEEP) != 0U) {
        g_ch32h417_usbhs_diag.sleep++;
    }
    if ((int_fg & USBHS_UDIF_LPM_ACT) != 0U) {
        g_ch32h417_usbhs_diag.lpm++;
    }
    if ((int_fg & USBHS_UDIF_LINK_RDY) != 0U) {
        g_ch32h417_usbhs_diag.link_ready++;
        usbd_event_connect_handler(busid);
    }

    if ((int_fg & USBHS_UDIF_TRANSFER) != 0U) {
        g_ch32h417_usbhs_diag.transfer++;
        ep_idx = (uint8_t)(int_st & USBHS_UD_INT_EP_ID_MASK);

        if (ep_idx < USB_CH32H417_MAX_EP_NUM) {
            if ((int_st & USBHS_UD_INT_DIR_IN) == USBHS_UD_INT_DIR_OUT) {
                if (ep_idx == 0U) {
                    usbhs_handle_ep0_out_xfer_complete(busid);
                } else {
                    usbhs_handle_ep_out_xfer_complete(busid, ep_idx);
                }
            } else {
                if (ep_idx == 0U) {
                    usbhs_handle_ep0_in_xfer_complete(busid);
                } else {
                    usbhs_handle_ep_in_xfer_complete(busid, ep_idx);
                }
            }
        }
    }

    *usbhs_reg8(USBHS_OFFSET_USB_INT_FG) = int_fg;
}

void USBHS_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USBHS_IRQHandler(void)
{
    GET_INT_SP();
    rt_interrupt_enter();
    USBD_IRQHandler(USB_CH32H417_BUS_HS);
    rt_interrupt_leave();
    FREE_INT_SP();
}
